fe40/tutorials/rheoFoam/OtherTests/Channel2D_VE/WhiteMetznerCYLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             WhiteMetznerCYLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;                
                
          //- etaP  
                etaP             etaP [1 -1 -1 0 0 0 0] .99;
                K                K [0 0 1 0 0 0 0] 1.5;
                a                a [0 0 0 0 0 0 0] 2.;
                n                n [0 0 0 0 0 0 0] 0.1;
                
          //- lambda  
                lambda           lambda [0 0 1 0 0 0 0] .1;
		L                L [0 0 1 0 0 0 0] 1.5;
		b                b [0 0 0 0 0 0 0] 2.;
		m                m [0 0 0 0 0 0 0] 0.1;		
		              
                stabilization    coupling;               
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
